<?php
    header("Content-Type: text/html; charset=utf-8");
    mb_internal_encoding('UTF-8');
?>
 <p><b>Задание 1</b> </p><br>
 <p>С помощью цикла while выведите все числа в промежутке от 0 до 100, которые
делятся на 3 без остатка.<br>
<?php
   $a=0;
    while ($a++ < 100)

    if ($a%3==0) 

    echo $a. '</br>';

    ?>
<br>
<p><b>Задание 2</b> </p><br>
<p>С помощью цикла do…while напишите функцию для вывода чисел от 0 до 10,
  чтобы результат выглядел так:
  0 – это ноль
  1 – нечетное число
  2 – четное число
  3 – нечетное число
  …
  10 – четное число </p><br>

<?php
   $n = 10;
   $i = 0;
  function num1($i) {
    if ($i == 0) {
      return "$i" . ' - это ноль<br />';
    }
    if ($i % 2) {
      return "$i" . ' - нечетное число<br />';
    } else {
      return "$i" . ' - четное число<br />';
    }
  }
   
  do {
    echo num1($i);
    $i++;
  } while ($i <= $n); 

    ?>
   <br>

   <p><b>Задание 3</b> </p><br>
   <p>Задание со звездочкой. Выведите с помощью цикла for числа от 0 до 9, НЕ
    используя тело цикла. То есть выглядеть должно вот так:
    for(…){// здесь пусто} </p><br>
   <?php
        for ($n = 0; $n < 10; print $n++) {}

    ?>
   <br>

   <p><b>Задание 4</b> </p><br>
   <p>Объявите массив, где в качестве ключей будут использоваться названия областей, а
    в качестве значений – массивы с названиями городов из соответствующей области.
    Выведите в цикле значения массива, чтобы результат был таким:
    Московская область:
     Москва, Зеленоград, Клин
    Ленинградская область:
     Санкт-Петербург, Всеволожск, Павловск, Кронштадт
    Рязанская область<br> Повторите предыдущее задание, но выводите на экран
только города, начинающиеся с буквы «К». <br>  </p><br>
  
    <?php
      $arr = array (
                "Московская область" => array ("Mосква", "Зеленоград", "Клин"),
                "Ленинградская область" => array ("Санкт-Петербург", "Всеволжск", "Павловск", "Кронштадт"),
                "Рязанская область" => array ("Кораблино", "Сасово", "Касимов")
);
 
      foreach ($arr as $Area => $aCity)
      {
              echo(
                      "<b>$Area</b> :</br>"
                     
              );
              foreach ($aCity as $key => $City)
              {
                      echo("$City</br>");
              }

              foreach ($arr as $Area => $aCity){

              foreach ($aCity as $key => $City){
                if ($City[0] == "К")
                                echo $City . "<br/>";
        }
      }
             
      }
      
    ?>
    <br>
    <p><b>Задание 6</b> </p><br>
    <p>Объявите массив, индексами которого являются буквы русского языка, а
  значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’
  => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
  Напишите функцию транслитерации строк.  </p><br>
    <?php 
      function translate($str){
        $converter = array(
          "а" => "a", 
          "б" => "b", 
          "в" => "v", 
          "г" => "g", 
          "д" => "d", 
          "е" => "e", 
          "ё" => "yo",
          "ж" => "zh", 
          "з" => "z", 
          "и" => "i", 
          "й" => "y", 
          "к" => "k", 
          "л" => "l", 
          "м" => "m",
          "н" => "n", 
          "о" => "o", 
          "п" => "p", 
          "р" => "r", 
          "с" => "s", 
          "т" => "t", 
          "у" => "u",
          "ф" => "f", 
          "х" => "h", 
          "ц" => "ts", 
          "ч" => "ch", 
          "ш" => "sh", 
          "щ" => "s'h", 
          "ъ" => "",
          "ы" => "i", 
          "ь" => "'", 
          "э" => "e", 
          "ю" => "yu", 
          "я" => "ya", 
        );
       
        $letters = strtr($str, $converter);
        echo "$letters"; 
      };
       
      translate("перевод");
    ?>


    <br>
    <p><b>Задание 7</b> </p><br>
    <p>Напишите функцию, которая заменяет в строке пробелы на подчеркивания и
     возвращает видоизмененную строчку.  </p>
    <?php 
      function replace($string)
      {
          if (!is_string($string)) {
              return "incorrect argument {$string}";
          }
          return preg_replace('/\s/', '_', $string);
      }
      echo replace('Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.');
    ?>
    <br>
    <p><b>Задание 8</b> </p><br>
    <?php 

      function translateReplace($string)
      {
          if (!is_string($string)) {
              return "incorrect argument {$string}";
          }

          $converter = array(
          "а" => "a", 
          "б" => "b", 
          "в" => "v", 
          "г" => "g", 
          "д" => "d", 
          "е" => "e", 
          "ё" => "yo",
          "ж" => "zh", 
          "з" => "z", 
          "и" => "i", 
          "й" => "y", 
          "к" => "k", 
          "л" => "l", 
          "м" => "m",
          "н" => "n", 
          "о" => "o", 
          "п" => "p", 
          "р" => "r", 
          "с" => "s", 
          "т" => "t", 
          "у" => "u",
          "ф" => "f", 
          "х" => "h", 
          "ц" => "ts", 
          "ч" => "ch", 
          "ш" => "sh", 
          "щ" => "s'h", 
          "ъ" => "",
          "ы" => "i", 
          "ь" => "'", 
          "э" => "e", 
          "ю" => "yu", 
          "я" => "ya", 
        );


          return preg_replace('/\s/', '_', ($string));


      }
      echo translateReplace('Объедините две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию');
    ?>
